InformationRegisters/СтатусыГексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыГексов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ландшафт</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Ландшафты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Гекс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Гексы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Ландшафты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Ландшафты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пастбище</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пашня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Холм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пустыня</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/РаботаСЛандшафтамиСервер/Ext/Module.bsl
Функция ГенераторСлучайныхЧиселДляЖетонов()
    
    МассивЖетонов = Новый Массив;
    
    МассивЖетонов.Добавить(2); 	
	Для сч=3 по 11 Цикл
		Если сч <> 7 Тогда
    		МассивЖетонов.Добавить(сч); 
			МассивЖетонов.Добавить(сч);
		КонецЕсли;
	КонецЦикла;   
	МассивЖетонов.Добавить(12);
	
	////Перемешиваем массив для случайного порядка
    ОбщийМодульСервер.ПеремешатьМассив(МассивЖетонов);  

	Возврат МассивЖетонов; 
	
КонецФункции  

Функция ГенераторСлучайныхЛандшафтов()
	
  МассивЛандшафтов = Новый Массив;
	  
  Для Шаг = 1 По 4 Цикл
	  МассивЛандшафтов.Добавить(Перечисления.Ландшафты.Лес);
	  МассивЛандшафтов.Добавить(Перечисления.Ландшафты.Пастбище);
	  МассивЛандшафтов.Добавить(Перечисления.Ландшафты.Пашня);
  КонецЦикла; 
  
  Для Шаг = 1 По 3 Цикл
	  МассивЛандшафтов.Добавить(Перечисления.Ландшафты.Гора);
	  МассивЛандшафтов.Добавить(Перечисления.Ландшафты.Холм);
  КонецЦикла;
  
  МассивЛандшафтов.Добавить(Перечисления.Ландшафты.Пустыня);
  
  ОбщийМодульСервер.ПеремешатьМассив(МассивЛандшафтов);
    
  Возврат МассивЛандшафтов; 
  
КонецФункции 

Процедура ЗаполнитьРегистрСведенийтатусыГексов(Ландщафты, Жетоны);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Гексы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Гексы КАК Гексы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ШагЛандшафты = 0;
	ШагЖетоны = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.СтатусыГексов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Гекс = ВыборкаДетальныеЗаписи.Ссылка;
		
		НоваяЗапись.Ландшафт = Ландщафты[ШагЛандшафты];
		
		Если Ландщафты[ШагЛандшафты] <> Перечисления.Ландшафты.Пустыня Тогда 
			 НоваяЗапись.Номер = Жетоны[ШагЖетоны];
			 ШагЖетоны = ШагЖетоны + 1;
		КонецЕсли;
		
		ШагЛандшафты = ШагЛандшафты + 1;
		
		НоваяЗапись.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция Текстуры ()

	Структура = Новый Структура();
	
	Для каждого Ландшафт Из Перечисления.Ландшафты Цикл
		
		Картинка = БиблиотекаКартинок["" + Ландшафт];
		Ссылка = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
		
		Структура.Вставить(Ландшафт, Ссылка);
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

Функция ПолучитьГексыХТМЛ ()Экспорт
	
	Ландшафты = ГенераторСлучайныхЛандшафтов();
	Жетоны = ГенераторСлучайныхЧиселДляЖетонов();
	Текстуры = Текстуры();
	СтруктураЛандшафты = Новый Структура();
	
	ЗаполнитьРегистрСведенийтатусыГексов(Ландшафты, Жетоны);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыГексов.Номер КАК Номер,
	               |	СтатусыГексов.Ландшафт КАК Ландшафт
	               |ИЗ
	               |	РегистрСведений.СтатусыГексов КАК СтатусыГексов";
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Гекс = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаДляПоиска = "N" + Гекс + "Number";
		Если ВыборкаДетальныеЗаписи.Ландшафт <> Перечисления.Ландшафты.Пустыня Тогда
			
			СтруктураЛандшафты.Вставить(СтрокаДляПоиска, ВыборкаДетальныеЗаписи.Номер);
			//РаботаСЛандшафтамиКлиент.ЗаменитьЖетоны(СтрокаДляПоиска, ВыборкаДетальныеЗаписи.Номер, Форма);
		Иначе
			СтруктураЛандшафты.Вставить(СтрокаДляПоиска, 0);
		КонецЕсли;
		
		СтрокаДляПоиска = "H" + Гекс + "Hex";
		СтруктураЛандшафты.Вставить(СтрокаДляПоиска, Текстуры["" + ВыборкаДетальныеЗаписи.Ландшафт]);
		//РаботаСЛандшафтамиКлиент.ЗаменитьЛандшафт(СтрокаДляПоиска, Текстуры[ВыборкаДетальныеЗаписи.Ландшафт], Форма);

		Гекс = Гекс + 1;
		
	КонецЦикла;	
	
	Возврат СтруктураЛандшафты;
КонецФункции
